In [119]:
import pandas as pd
import numpy as np

In [120]:
#store file path to a variable and read file
filepath="Resources/purchase_data.csv"
pymoli_pd=pd.read_csv(filepath)
pymoli_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [121]:
###Player Count
##collect total number of players
players_count=len(pymoli_pd["SN"].unique())
print("There are " +str(players_count)+" players")

There are 576 players

In [122]:
###Purchasing Analysis(total)
##collect number of unique items that were purchased
items_count=len(pymoli_pd["Item ID"].unique())
print("There are " + str(items_count)+" items purchased")

There are 183 items purchased

In [123]:
##calculate average purchase price
average_price=pymoli_pd["Price"].mean()
print("The average price is $" + str(round(average_price,2)))

The average price is $3.05

In [124]:
##calculate total number of purchases
purchases_number=pymoli_pd["Purchase ID"].count()
print("There are " + str(purchases_number) + " purchases")

There are 780 purchases

In [125]:
##calculate total revenue
total_revenue=pymoli_pd["Price"].sum()
print("Total revenue is $"+str(total_revenue))

Total revenue is $2379.77

In [126]:
###Gender Demographics
##percentage and count of male/female/non-disclosed players
#create a dataframe which only only contains SN and Gender information
gender_info_df=pymoli_pd[["SN","Gender"]]
gender_info_df.head()

              SN Gender
0        Lisim78   Male
1    Lisovynya38   Male
2     Ithergue48   Male
3  Chamassasya86   Male
4      Iskosia90   Male

In [127]:
#drop duplicate lines from the gender dataframe
reduced_gender_info=gender_info_df.drop_duplicates()
#group the reduced gender information by Gender
grouped_gender_df=reduced_gender_info.groupby(["Gender"])
grouped_gender_df.count()

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [128]:
#calculate counts and percentages
female_percentage=81/players_count
male_percentage=484/players_count
non_disclosed_percentage=11/players_count
print("Female percentage is "+ str(round(female_percentage,2)))
print("Male percentage is "+str(round(male_percentage,2)))
print("Non_disclosed percentage is"+str(round(non_disclosed_percentage,2)))

Female percentage is 0.14
Male percentage is 0.84
Non_disclosed percentage is0.02

In [129]:
### Purchasing Analysis (Gender)
#group original data by Gender and get purchase count by Gender
purchase_by_gender_df=pymoli_pd.groupby(["Gender"])
purchase_by_gender_df["Purchase ID"].count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [130]:
#create a dataframe only contains purchases made by male, and calculate the total
male_purchase_df=pymoli_pd.loc[pymoli_pd["Gender"]=="Male",:]
total_male_purchase=male_purchase_df["Price"].sum()
print("Total purchases made by male is $"+str(total_male_purchase))

Total purchases made by male is $1967.64

In [131]:
#caculate average price of purchases made by male players
average_male_purchase_price=male_purchase_df["Price"].mean()
print("Average price of purchases made by male is $"+str(round(average_male_purchase_price,2)))

Average price of purchases made by male is $3.02

In [132]:
#calculate average purchase per person made by male players using male players number we got from above
purchase_per_male_player=round(total_male_purchase/484,2)
print("Average purchase person made by male players is $"+str(purchase_per_male_player))

Average purchase person made by male players is $4.07

In [133]:
#create a dataframe only contains purchases made by female, and calculate the total
female_purchase_df=pymoli_pd.loc[pymoli_pd["Gender"]=="Female",:]
total_female_purchase=female_purchase_df["Price"].sum()
print("Total purchases made by female is $"+str(total_female_purchase))

Total purchases made by female is $361.94

In [134]:
#caculate average price of purchases made by female players
average_female_purchase_price=female_purchase_df["Price"].mean()
print("Average price of purchases made by female is $"+str(round(average_female_purchase_price,2)))

Average price of purchases made by female is $3.2

In [135]:
#calculate average purchase per person made by female players using female players number we got from above
purchase_per_female_player=round(total_female_purchase/81,2)
print("Average purchase person made by female players is $"+str(purchase_per_female_player))

Average purchase person made by female players is $4.47

In [136]:
### Age Demographics
##The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
#create bin and diplay as one column of the original data
bin=[0,10,14,19,24,29,34,39,44,49]
bin_names=["1-10","11-14","15-19","20-24","25-29","30-34","35-39","40-44","45-49"]
pymoli_pd["Age Group"]=pd.cut(pymoli_pd["Age"],bin,labels=bin_names)
pymoli_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40-44
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [137]:
#group by Age Group to find out purchase count for each age group
age_grouped_df=pymoli_pd.groupby(["Age Group"])
age_grouped_df["Purchase ID"].count()

Age Group
1-10      32
11-14     19
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40-44     12
45-49      1
Name: Purchase ID, dtype: int64

In [138]:
#calculate total purchase value by age group
age_grouped_df["Price"].sum()

Age Group
1-10      108.96
11-14      50.95
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40-44      36.54
45-49       1.70
Name: Price, dtype: float64

In [139]:
#calculate average purchase price by age group
age_grouped_df["Price"].mean()

Age Group
1-10     3.405000
11-14    2.681579
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40-44    3.045000
45-49    1.700000
Name: Price, dtype: float64

In [140]:
### Top Spenders
#group original dataframe by SN
individual_player_purchase_total=pymoli_pd.groupby(["SN"]).sum()
#sort the data by largest price number
individual_player_purchase_total.sort_values(["Price"],ascending=False)
#keep top 5's total purchase value
top_five_total_purchase=individual_player_purchase_total.loc[["Lisosia93","Idastidru52","Chamjask73","Iral74","Iskadarya95"],["Price"]]
top_five_total_purchase=top_five_total_purchase.rename(columns={"Price":"Total Purchase"})
top_five_total_purchase

             Total Purchase
SN
Lisosia93             18.96
Idastidru52           15.45
Chamjask73            13.83
Iral74                13.62
Iskadarya95           13.10

In [141]:
#find out how many purchase each player buy
purchase_count=pymoli_pd.groupby(["SN"]).count()
#select top five people who are on the "top_five_total_purchase" table above
top_five_purchase_count=purchase_count.loc[["Lisosia93","Idastidru52","Chamjask73","Iral74","Iskadarya95"],["Purchase ID"]]
#rename column 
top_five_purchase_count=top_five_purchase_count.rename(columns={"Purchase ID":"Purchase Count"})
top_five_purchase_count

             Purchase Count
SN
Lisosia93                 5
Idastidru52               4
Chamjask73                3
Iral74                    4
Iskadarya95               3

In [142]:
#combine two tables of total purchase and purchase count
combine_table=pd.merge(top_five_total_purchase,top_five_purchase_count,on="SN",how="outer")
combine_table

             Total Purchase  Purchase Count
SN
Lisosia93             18.96               5
Idastidru52           15.45               4
Chamjask73            13.83               3
Iral74                13.62               4
Iskadarya95           13.10               3

In [143]:
#calculate average price for each of the top 5 buyer
combine_table["Average Price"]=combine_table["Total Purchase"]/combine_table["Purchase Count"]
#add $ to average price column and keep 2 numbers after decimal
combine_table["Average Price"]=combine_table["Average Price"].map("${:.2f}".format)
combine_table

             Total Purchase  Purchase Count Average Price
SN
Lisosia93             18.96               5         $3.79
Idastidru52           15.45               4         $3.86
Chamjask73            13.83               3         $4.61
Iral74                13.62               4         $3.40
Iskadarya95           13.10               3         $4.37

In [144]:
###Most Popular items
#group dataframe by item ID and count
item_count=pymoli_pd.groupby(["Item ID"]).count()
#sort the table by largest number
item_count.sort_values(["Purchase ID"],ascending=False)
#take top 5 items in the table
top_five_polular_items=item_count.loc[[178,145,108,82,19],["Purchase ID"]]
#change column name
top_five_polular_items=top_five_polular_items.rename(columns={"Purchase ID":"Times Purchased"})
top_five_polular_items

         Times Purchased
Item ID
178                   12
145                    9
108                    9
82                     9
19                     8

In [145]:
#create a new dataframe which contains item ID, item name and price info
item_info=pymoli_pd[["Item ID","Item Name","Price"]]
#drop duplicate
cleaned_item_info=item_info.drop_duplicates()
#select top five popular items and their names and price
top_five_popular_name_and_price=cleaned_item_info.loc[(cleaned_item_info["Item ID"]==178)|(cleaned_item_info["Item ID"]==145)\
                                                     |(cleaned_item_info["Item ID"]==108)|(cleaned_item_info["Item ID"]==82)\
                                                     |(cleaned_item_info["Item ID"]==19),:]
top_five_popular_name_and_price

     Item ID                                     Item Name  Price
0        108     Extraction, Quickblade Of Trembling Hands   3.53
18        82                                       Nirvana   4.90
25       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
132      145                          Fiery Glass Crusader   4.58
239       19                 Pursuit, Cudgel of Necromancy   1.02

In [146]:
#combine two tables 
combine_popular_items=pd.merge(top_five_popular_name_and_price,top_five_polular_items,on="Item ID",how="outer")
combine_popular_items

,Item ID,Item Name,Price,Times Purchased
0,108,"Extraction, Quickblade Of Trembling Hands",3.53,9
1,82,Nirvana,4.90,9
2,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12
3,145,Fiery Glass Crusader,4.58,9
4,19,"Pursuit, Cudgel of Necromancy",1.02,8

In [147]:
#calculate total purchase value and add as a column
combine_popular_items["Total Purchase Value"]=combine_popular_items["Price"]*combine_popular_items["Times Purchased"]
combine_popular_items

,Item ID,Item Name,Price,Times Purchased,Total Purchase Value
0,108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
1,82,Nirvana,4.90,9,44.10
2,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
3,145,Fiery Glass Crusader,4.58,9,41.22
4,19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16

In [148]:
### Most Profitable Items
#group dataframe by item ID and calculate the total amount
item_profit=pymoli_pd.groupby(["Item ID"]).sum()
#sort the table by largest number
item_profit.sort_values(["Price"],ascending=False)
#take top 5 items in the table
top_five_profitable=item_profit.loc[[178,82,145,92,103],["Price"]]
top_five_profitable
#change column name
top_five_profitable=top_five_profitable.rename(columns={"Price":"Total Profit"})
top_five_profitable

         Total Profit
Item ID
178             50.76
82              44.10
145             41.22
92              39.04
103             34.80

In [149]:
#check counts of items
item_count.head()

         Purchase ID  SN  Age  Gender  Item Name  Price  Age Group
Item ID
0                  4   4    4       4          4      4          4
1                  3   3    3       3          3      3          3
2                  6   6    6       6          6      6          6
3                  6   6    6       6          6      6          6
4                  5   5    5       5          5      5          5

In [150]:
#pick top five profitable items from above table
top_five_profitable_count=item_count.loc[[178,145,103,82,92],["Purchase ID"]]
top_five_profitable_count

         Purchase ID
Item ID
178               12
145                9
103                8
82                 9
92                 8

In [151]:
# merge top_five_profitable and top_five_profitable_count
merge_table=pd.merge(top_five_profitable,top_five_profitable_count,on="Item ID",how="outer")
#change column name
merge_table=merge_table.rename(columns={"Purchase ID":"Purchase Count"})
merge_table

         Total Profit  Purchase Count
Item ID
178             50.76              12
82              44.10               9
145             41.22               9
92              39.04               8
103             34.80               8

In [152]:
#check item ID, item name, and item price info from previouly created dataframe
cleaned_item_info.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [153]:
#select the top 5 profitable items found from above
top_five_profitable_name_and_price=cleaned_item_info.loc[(cleaned_item_info["Item ID"]==178)|(cleaned_item_info["Item ID"]==145)\
                                                     |(cleaned_item_info["Item ID"]==103)|(cleaned_item_info["Item ID"]==82)\
                                                     |(cleaned_item_info["Item ID"]==92),:]

top_five_profitable_name_and_price

     Item ID                                     Item Name  Price
2         92                                  Final Critic   4.88
18        82                                       Nirvana   4.90
25       178  Oathbreaker, Last Hope of the Breaking Storm   4.23
132      145                          Fiery Glass Crusader   4.58
175      103                                Singed Scalpel   4.35

In [154]:
#merge top_five_profitable_name_and_price and merge_table
combine_profitable_table=pd.merge(top_five_profitable_name_and_price,merge_table,on="Item ID",how="outer")
combine_profitable_table

,Item ID,Item Name,Price,Total Profit,Purchase Count
0,92,Final Critic,4.88,39.04,8
1,82,Nirvana,4.90,44.10,9
2,178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,50.76,12
3,145,Fiery Glass Crusader,4.58,41.22,9
4,103,Singed Scalpel,4.35,34.80,8